{
  "c01": "Labels",
  "c02": "-------------------------",
  "lbl_apptitle": "Unizer",
  "lbl_appversion": "version {}",
  "lbl_oneliner": "Unite. Connect. Enjoy.",
  "lbl_forgot-password": "Forgot password?",
  "lbl_login": "Login",
  "lbl_insert-email": "Your email",
  "lbl_insert-password": "Your password",
  "lbl_register": "Register",
  "lbl_language": "Language",
  "lbl_confirm": "Confirm",
  "lbl_close": "Close",
  "lbl_keep-connected": "Keep connected!",
  "lbl_first-name": "First name",
  "lbl_last-name": "Last name",
  "lbl_email": "Email",
  "lbl_password": "Password",
  "lbl_cancel": "Cancel",
  "lbl_home": "Home",
  "lbl_visit-edit-profile": "View and edit your profile",
  "lbl_unizers": "Unizers",
  "lbl_teams": "Teams",
  "lbl_organisations": "Organisations",
  "c03": "",
  "c04": "Lists",
  "c05": "-------------------------",
  "lst_languages": { "nl": "Nederlands", "en": "English"},
  "c06": "",
  "c07": "Messages",
  "c08": "-------------------------",
  "msg_no-user-account": "Have no Unizer account yet? Register here!",
  "msg_register-info": "Enter your details to get access to your account.",
  "msg_insert-all-required-fields": "Something is missing. Please fill all fields!",
  "msg_required-field": "Please enter your {}.",
  "msg_user-created-succes": "Created user {} succesfully.",
  "msg_password-invalid": "Your password is invalid: it should at least contain 6 characters.",
  "msg_user-login-succes-as": "You're succesfully logged in as {}.",
  "msg_welcome-username": "Welcome {}!",
  "msg_up-to-date": "You're completely up-to-date.",
  "c09": "",
  "c10": "Firebase error codes",
  "c11": "-------------------------",
  "fireb_err_error-retry-phone-auth": "An error occurred during authentication using the PhoneAuthCredential. Please retry authentication.",
  "fireb_err_error-api-not-available": "The API that you are calling is not available on devices without Google Play Services.",
  "fireb_err_error-unknown": "An unknown error occurred.",
  "fireb_err_error-invalid-custom-token": "The custom token format is incorrect. Please check the documentation.",
  "fireb_err_error-custom-token-mismatch": "Invalid configuration. Ensure your app's SHA1 is correct in the Firebase console.",
  "fireb_err_error-invalid-credential": "The supplied auth credential is malformed or has expired.",
  "fireb_err_error-user-disabled": "The user account has been disabled by an administrator.",
  "fireb_err_error-operation-not-allowed": "This operation is not allowed. Enable the sign-in method in the Authentication tab of the Firebase console",
  "fireb_err_error-email-already-in-use": "The email address is already in use by another account.",
  "fireb_err_error-invalid-email": "The email address is badly formatted.",
  "fireb_err_error-wrong-password": "The password is invalid.",
  "fireb_err_error-too-many-requests": "We have blocked all requests from this device due to unusual activity. Try again later.",
  "fireb_err_error-user-not-found": "There is no user record corresponding to this identifier. The user may have been deleted.",
  "fireb_err_error-account-exists-with-different-credential": "An account already exists with the same email address but different sign-in credentials. Sign in using a provider associated with this email address.",
  "fireb_err_error-requires-recent-login": "This operation is sensitive and requires recent authentication. Log in again before retrying this request.",
  "fireb_err_error-provider-already-linked": "User can only be linked to one identity for the given provider.",
  "fireb_err_error-no-such-provider": "User was not linked to an account with the given provider.",
  "fireb_err_error-invalid-user-token": "The user's credential is no longer valid. The user must sign in again.",
  "fireb_err_error-network-request-failed": "Network error (such as timeout, interrupted connection or unreachable host) has occurred.",
  "fireb_err_error-user-token-expired": "The user's credential has expired. The user must sign in again.",
  "fireb_err_error-invalid-api-key": "An invalid API Key was supplied in the request.",
  "fireb_err_error-user-mismatch": "The supplied credentials do not correspond to the previously signed in user.",
  "fireb_err_error-credential-already-in-use": "This credential is already associated with a different user account.",
  "fireb_err_error-weak-password": "The given password is too weak, please choose a stronger password.",
  "fireb_err_error-app-not-authorized": "This app is not authorized to use Firebase Authentication. Please verify that the correct package name and SHA-1 are configured in the Firebase Console.",
  "fireb_err_error-expired-action-code": "The out of band code has expired.",
  "fireb_err_error-invalid-action-code": "The out of band code is invalid. This can happen if the code is malformed, expired, or has already been used.",
  "fireb_err_error-invalid-message-payload": "The email template corresponding to this action contains invalid characters in its message. Please fix by going to the Auth email templates section in the Firebase Console.",
  "fireb_err_error-invalid-sender": "The email template corresponding to this action contains an invalid sender email or name. Please fix by going to the Auth email templates section in the Firebase Console.",
  "fireb_err_error-invalid-recipient-email": "The email corresponding to this action failed to send as the provided recipient email address is invalid.",
  "fireb_err_error-missing-email": "An email address must be provided.",
  "fireb_err_error-missing-password": "A password must be provided.",
  "fireb_err_error-missing-ios-bundle-id": "An iOS Bundle ID must be provided if an App Store ID is provided.",
  "fireb_err_error-missing-android-pkg-name": "An Android Package Name must be provided if the Android App is required to be installed.",
  "fireb_err_error-unauthorized-domain": "The domain of the continue URL is not whitelisted. Please whitelist the domain in the Firebase console.",
  "fireb_err_error-invalid-continue-uri": "The continue URL provided in the request is invalid.",
  "fireb_err_error-missing-continue-uri": "A continue URL must be provided in the request.",
  "fireb_err_error-missing-phone-number": "To send verification codes, provide a phone number for the recipient.",
  "fireb_err_error-invalid-phone-number": "The format of the phone number provided is incorrect. Please enter the phone number in a format that can be parsed into E.164 format. E.164 phone numbers are written in the format [+][country code][subscriber number including area code].",
  "fireb_err_error-missing-verification-code": "The phone auth credential was created with an empty sms verification code",
  "fireb_err_error-invalid-verification-code": "The sms verification code used to create the phone auth credential is invalid. Please resend the verification code sms and be sure use the verification code provided by the user.",
  "fireb_err_error-missing-verification-id": "The phone auth credential was created with an empty verification ID",
  "fireb_err_error-invalid-verification-id": "The verification ID used to create the phone auth credential is invalid.",
  "fireb_err_missing-app-credential": "The phone verification request is missing an APNs Device token. Firebase Auth automatically detects APNs Device Tokens, however, if method swizzling is disabled, the APNs token must be set via the APNSToken property on FIRAuth or by calling setAPNSToken:type on FIRAuth.",
  "fireb_err_invalid-app-credential": "The APNs device token provided is either incorrect or does not match the private certificate uploaded to the Firebase Console.",
  "fireb_err_error-session-expired": "The sms code has expired. Please re-send the verification code to try again.",
  "fireb_err_error-quota-exceeded": "The sms quota for this project has been exceeded.",
  "fireb_err_error-missing-app-token": "There seems to be a problem with your project's Firebase phone number authentication set-up, please make sure to follow the instructions found at https://firebase.google.com/docs/auth/ios/phone-auth",
  "fireb_err_error-notification-not-forwarded": "If app delegate swizzling is disabled, remote notifications received by UIApplicationDelegate need to be forwarded to FIRAuth's canHandleNotificaton: method.",
  "fireb_err_error-app-not-verified": "Firebase could not retrieve the silent push notification and therefore could not verify your app. Ensure that you configured your app correctly to receive push notifications.",
  "fireb_err_error-captcha-check-failed": "The reCAPTCHA response token provided is either invalid, expired or already",
  "fireb_err_error-web-context-already-presented": "User interaction is still ongoing, another view cannot be presented.",
  "fireb_err_error-web-context-cancelled": "The interaction was cancelled by the user.",
  "fireb_err_error-app-verification-failed": "The app verification process has failed, print and inspect the error details for more information",
  "fireb_err_error-invalid-client-id": "The OAuth client ID provided is either invalid or does not match the specified API key.",
  "fireb_err_error-web-network-request-failed": "A network error (such as timeout, interrupted connection, or unreachable host) has occurred within the web context.",
  "fireb_err_error-web-internal-error": "An internal error has occurred within the SFSafariViewController or UIWebView.",
  "fireb_err_error-null-user": "A null user object was provided as the argument for an operation which requires a non-null user object.",
  "fireb_err_error-keychain-error": "An error occurred when accessing the keychain.",
  "fireb_err_error-internal-error": "An internal error has occurred, print and inspect the error details for more information.",
  "fireb_err_error-malformed-jwt": "Failed to parse JWT. Check the userInfo dictionary for the full token."
}