{
  "c01": "Labels",
  "c02": "-------------------------",
  "lbl_apptitle": "Unizer",
  "lbl_appversion": "versie {}",
  "lbl_oneliner": "Verbinden. Samenwerken. Genieten.",
  "lbl_forgot-password": "Wachtwoord vergeten?",
  "lbl_login": "Inloggen",
  "lbl_insert-email": "Je emailadres",
  "lbl_insert-password": "Je wachtwoord",
  "lbl_register": "Registreer",
  "lbl_language": "Taal",
  "lbl_confirm": "Bevestigen",
  "lbl_close": "Sluiten",
  "lbl_keep-connected": "Blijf verbonden!",
  "lbl_first-name": "Voornaam",
  "lbl_last-name": "Achternaam",
  "lbl_email": "Emailadres",
  "lbl_password": "Wachtwoord",
  "lbl_cancel": "Annuleer",
  "lbl_home": "Home",
  "lbl_visit-edit-profile": "Je profiel bekijken en bewerken",
  "c03": "",
  "c04": "Lists",
  "c05": "-------------------------",
  "lst_languages": { "nl": "Nederlands", "en": "Engels" },
  "c06": "",
  "c07": "Messages",
  "c08": "-------------------------",
  "msg_no-user-account": "Nog geen Unizer account? Registreer hier!",
  "msg_register-info": "Vul je gegevens in om toegang te krijgen tot je account.",
  "msg_insert-all-required-fields": "Er mist nog iets. Graag alle velden invullen!",
  "msg_required-field": "Vul hier je {} in.",
  "msg_user-created-succes": "Gebruiker {} is succesvol aangemaakt.",
  "msg_password-invalid": "Je wachtwoord is niet geldig: gebruik minimaal 6 tekens.",
  "msg_user-login-succes-as": "Je bent ingelogt als {}.",
  "msg_welcome-username": "Welkom {}!",
  "msg_up-to-date": "Je bent helemaal bij.",
  "c09": "",
  "c10": "Firebase error codes",
  "c11": "-------------------------",
  "fireb_err_error-retry-phone-auth": "Er is een fout opgetreden tijdens de verificatie met de PhoneAuthCredential. Probeer de verificatie opnieuw.",
  "fireb_err_error-api-not-available": "De API die u belt, is niet beschikbaar op apparaten zonder Google Play-services.",
  "fireb_err_error-unknown": "Een onbekende fout is opgetreden.",
  "fireb_err_error-invalid-custom-token": "Het aangepaste tokenformaat is onjuist. Raadpleeg de documentatie.",
  "fireb_err_error-custom-token-mismatch": "Ongeldige configuratie. Zorg ervoor dat de SHA1 van uw app correct is in de Firebase-console.",
  "fireb_err_error-invalid-credential": "De opgegeven verificatiegegevens hebben een onjuiste indeling of zijn verlopen.",
  "fireb_err_error-user-disabled": "Het gebruikersaccount is uitgeschakeld door een beheerder.",
  "fireb_err_error-operation-not-allowed": "Deze bewerking is niet toegestaan. Schakel de inlogmethode in op het tabblad Verificatie van de Firebase-console",
  "fireb_err_error-email-already-in-use": "Het e-mailadres is al in gebruik door een ander account.",
  "fireb_err_error-invalid-email": "Het e-mailadres is slecht geformatteerd.",
  "fireb_err_error-wrong-password": "Het wachtwoord is ongeldig.",
  "fireb_err_error-too-many-requests": "We hebben alle verzoeken van dit apparaat geblokkeerd vanwege ongebruikelijke activiteit. Probeer het later opnieuw.",
  "fireb_err_error-user-not-found": "Er is geen gebruikersrecord dat overeenkomt met deze identificatie. De gebruiker is mogelijk verwijderd.",
  "fireb_err_error-account-exists-with-different-credential": "Er bestaat al een account met hetzelfde e-mailadres maar met verschillende inlogreferenties. Log in met een provider die aan dit e-mailadres is gekoppeld.",
  "fireb_err_error-requires-recent-login": "Deze bewerking is gevoelig en vereist recente authenticatie. Meld u opnieuw aan voordat u dit verzoek opnieuw probeert.",
  "fireb_err_error-provider-already-linked": "Gebruikers kunnen slechts aan één identiteit voor de betreffende provider worden gekoppeld.",
  "fireb_err_error-no-such-provider": "Gebruiker was niet gekoppeld aan een account bij de betreffende provider.",
  "fireb_err_error-invalid-user-token": "De gebruikersreferentie is niet langer geldig. De gebruiker moet opnieuw inloggen.",
  "fireb_err_error-network-request-failed": "Netwerkfout (zoals time-out, onderbroken verbinding of onbereikbare host) is opgetreden.",
  "fireb_err_error-user-token-expired": "De gebruikersreferentie is verlopen. De gebruiker moet opnieuw inloggen.",
  "fireb_err_error-invalid-api-key": "Er is een ongeldige API-sleutel in het verzoek opgegeven.",
  "fireb_err_error-user-mismatch": "De geleverde inloggegevens komen niet overeen met de eerder aangemelde gebruiker.",
  "fireb_err_error-credential-already-in-use": "Deze referentie is al gekoppeld aan een ander gebruikersaccount.",
  "fireb_err_error-weak-password": "Het opgegeven wachtwoord is te zwak, kies een sterker wachtwoord.",
  "fireb_err_error-app-not-authorized": "Deze app is niet gemachtigd om Firebase-verificatie te gebruiken. Controleer of de juiste pakketnaam en SHA-1 zijn geconfigureerd in de Firebase-console.",
  "fireb_err_error-expired-action-code": "De out of band-code is verlopen.",
  "fireb_err_error-invalid-action-code": "De out of band-code is ongeldig. Dit kan gebeuren als de code een onjuiste indeling heeft, is verlopen of al is gebruikt.",
  "fireb_err_error-invalid-message-payload": "De e-mailsjabloon die overeenkomt met deze actie bevat ongeldige tekens in het bericht. Corrigeer dit door naar het gedeelte Authentieke e-mailsjablonen in de Firebase-console te gaan.",
  "fireb_err_error-invalid-sender": "De e-mailsjabloon die overeenkomt met deze actie bevat een e-mail of naam van een ongeldige afzender. Corrigeer dit door naar het gedeelte Authentieke e-mailsjablonen in de Firebase-console te gaan.",
  "fireb_err_error-invalid-recipient-email": "Het e-mailbericht dat overeenkomt met deze actie kan niet worden verzonden omdat het e-mailadres van de ontvanger ongeldig is.",
  "fireb_err_error-missing-email": "Er moet een e-mailadres worden opgegeven.",
  "fireb_err_error-missing-password": "Er moet een wachtwoord worden verstrekt.",
  "fireb_err_error-missing-ios-bundle-id": "Een iOS-bundel-ID moet worden opgegeven als een App Store-ID wordt verstrekt.",
  "fireb_err_error-missing-android-pkg-name": "Er moet een Android-pakketnaam worden opgegeven als de Android-app moet worden geïnstalleerd.",
  "fireb_err_error-unauthorized-domain": "Het domein van de doorlopende URL staat niet op de witte lijst. Witte lijst van het domein in de Firebase-console.",
  "fireb_err_error-invalid-continue-uri": "De doorlopende URL in het verzoek is ongeldig.",
  "fireb_err_error-missing-continue-uri": "Er moet een doorlopende URL in het verzoek worden vermeld.",
  "fireb_err_error-missing-phone-number": "Als u verificatiecodes wilt verzenden, geeft u een telefoonnummer op voor de ontvanger.",
  "fireb_err_error-invalid-phone-number": "Het formaat van het opgegeven telefoonnummer is onjuist. Voer het telefoonnummer in een indeling in die kan worden geparseerd in E.164-indeling. E.164-telefoonnummers worden geschreven in de notatie [+] [landcode] [abonneenummer inclusief netnummer].",
  "fireb_err_error-missing-verification-code": "De autorisatiegegevens van de telefoon zijn gemaakt met een lege SMS-verificatiecode",
  "fireb_err_error-invalid-verification-code": "De sms-verificatiecode die is gebruikt om de autorisatiegegevens van de telefoon te maken, is ongeldig. Verstuur de verificatiecode sms opnieuw en gebruik de verificatiecode die door de gebruiker is verstrekt.",
  "fireb_err_error-missing-verification-id": "De autorisatiegegevens van de telefoon zijn gemaakt met een leeg verificatie-ID",
  "fireb_err_error-invalid-verification-id": "De verificatie-ID die is gebruikt om de autorisatiegegevens voor de telefoon te maken, is ongeldig.",
  "fireb_err_missing-app-credential": "Er ontbreekt een APN-apparaattoken in het telefoonverificatieaanvraag. Firebase Auth detecteert automatisch APN-apparaatmunten, maar als de swizzling-methode is uitgeschakeld, moet het APN-token worden ingesteld via de APNSToken-eigenschap op FIRAuth of door setAPNSToken aan te roepen: typ op FIRAuth.",
  "fireb_err_invalid-app-credential": "Het geleverde APN-apparaattoken is onjuist of komt niet overeen met het persoonlijke certificaat dat is geüpload naar de Firebase-console.",
  "fireb_err_error-session-expired": "De sms-code is verlopen. Verzend de verificatiecode opnieuw om het opnieuw te proberen.",
  "fireb_err_error-quota-exceeded": "Het sms-quotum voor dit project is overschreden.",
  "fireb_err_error-missing-app-token": "Er lijkt een probleem te zijn met de authenticatie-instellingen voor uw Firebase-telefoonnummer voor uw project. Zorg ervoor dat u de instructies op https://firebase.google.com/docs/auth/ios/phone-auth volgt.",
  "fireb_err_error-notification-not-forwarded": "Als swadling van app-delegatie is uitgeschakeld, moeten meldingen op afstand die zijn ontvangen door UIApplicationDelegate worden doorgestuurd naar de methode canHandleNotificaton van FIRAuth:",
  "fireb_err_error-app-not-verified": "Firebase kon de stille pushmelding niet ophalen en kon uw app daarom niet verifiëren. Zorg ervoor dat je je app correct hebt geconfigureerd om pushmeldingen te ontvangen.",
  "fireb_err_error-captcha-check-failed": "De verstrekte reCAPTCHA-antwoordfiche is ongeldig, verlopen of al",
  "fireb_err_error-web-context-already-presented": "Gebruikersinteractie is nog gaande, een andere weergave kan niet worden weergegeven.",
  "fireb_err_error-web-context-cancelled": "De interactie is geannuleerd door de gebruiker.",
  "fireb_err_error-app-verification-failed": "Het appverificatieproces is mislukt, print en inspecteer de foutgegevens voor meer informatie",
  "fireb_err_error-invalid-client-id": "De opgegeven OAuth-client-ID is ongeldig of komt niet overeen met de opgegeven API-sleutel.",
  "fireb_err_error-web-network-request-failed": "Een netwerkfout (zoals time-out, onderbroken verbinding of onbereikbare host) is opgetreden in de webcontext.",
  "fireb_err_error-web-internal-error": "Er is een interne fout opgetreden in de SFSafariViewController of UIWebView.",
  "fireb_err_error-null-user": "Er is een nulgebruikersobject opgegeven als argument voor een bewerking waarvoor een niet-nulgebruikersobject is vereist.",
  "fireb_err_error-keychain-error": "Er is een fout opgetreden bij het openen van de sleutelhanger.",
  "fireb_err_error-internal-error": "Er is een interne fout opgetreden, print en inspecteer de foutgegevens voor meer informatie.",
  "fireb_err_error-malformed-jwt": "Kan JWT niet analyseren. Controleer het woordenboek userInfo voor het volledige token."
}